a = int(input())
b = a % 10
c = a // 100
d = a // 1000
print( b,c,d)# Задача 5: Обратный порядок чисел
# Напишите программу, которая запрашивает у пользователя трехзначное число и выводит его цифры в обратном порядке.
# Пример:
# Ввод: 123
# Вывод: 321