a = int(input())
b = a % 10
c = a // 10
d = a // 100
print( b,c - 10 * d,d, sep = "")# Задача 5: Обратный порядок чисел
# Напишите программу, которая запрашивает у пользователя трехзначное число и выводит его цифры в обратном порядке.
# Пример:
# Ввод: 123
# Вывод: 321