a = int(input())
b= a % 2
if b > 0:
    print("нечетное")
else:
    print("четное")

# Задача 4: Проверка на четность
# Напишите программу, которая запрашивает у пользователя число и определяет, является ли оно четным или нечетным.
# Пример:
# Ввод: 8
# Вывод: Число 8 четное